
export const DEPARTMENTS = {
  'מחלקת שליטה': [
    'רע"ן אוה"ד',
    'רע"ן שליטה',
    'רז"ר ביטחון',
    'רע"ן דיגיטל',
    'רע"ן צבאי מערכתי'
  ],
  'מחלקת מבצעים': [
    'רז"ר דרום',
    'רז"ר מרכז',
    'רז"ר צפון',
    'רז"ר עורף',
    'רע"ן מבצעים',
    'רז"ר סייבר',
    'רע"ן תה"ם'
  ],
  'מחלקת תכנון': [
    'רע"ן תקיפה',
    'רע"ן ח"ח',
    'רע"ן רציפות התפקוד',
    'רת"ח גיו"כ',
    'רז"ר עומק',
    'רע"ן מעגל שני',
    'רע"ן תב"ל',
    'רע"ן תכנון'
  ]
};

export const getDepartmentList = () => Object.keys(DEPARTMENTS);

export const getRolesForDepartment = (department) => DEPARTMENTS[department] || [];
